# include <iostream>
using namespace std;

int main()
{
    // 若指针未初始化，指针变量中存放的是一个随机值
    int a = 3;
    int *p =&a;
    int *p1 = &a ; // 多个指针可以指向同一个变量
    cout<<"变量a的值为："<<a<<endl ;
    cout<<"*p="<<*p<<endl; // 指针解引用，通过指针变量访问a的值
    cout<<"*p1="<<*p1<<endl;

    *p1 =8; // 指针解引用，通过指针变量访问a的值并修改，等价于a=8和*p=8

    // *运算符被称为间接值或解除引用（解引用）运算符，将它用于指针，可以得到该地址的内存中存储的值，
    // *也是乘法符号，C++根据上下文来确定所指的是乘法还是解引用。
    cout<<"变量a的值为："<<a<<endl ;
    cout<<"*p="<<*p<<endl; 
    cout<<"*p1="<<*p1<<endl; 

    cout<<"&a="<<&a<<" p="<<p<<" p1="<<p1<<endl;  //地址相同


}